<?php
namespace App\Http\Controllers\NewsLine;

use Illuminate\Http\Request;
use App\Http\Controllers\Controller;

class NewsLineController extends Controller
{
    protected $news = [];
    protected $category = [];
    protected $society =[];
    protected $policy = [];
    protected $culture = [];
    protected $economy = [];
    protected $sport = [];

    public function __construct()
    {
        $this->news = [
            'Новость 1',
            'Новость 2',
            'Новость 3',
            'Новость 4',
            'Новость 5'
        ];


       $this->category = [
            'Общество',
            'Политика',
            'Культура',
            'Экономика',
            'Спорт'
       ];

        $this->society = [
            'Новости Общество 1'=>'Последние новости по теме общество 1',
            'Новости Общество 2'=>'Последние новости по теме общество 2',
            'Новости Общество 3'=>'Последние новости по теме общество 3',
            'Новости Общество 4'=>'Последние новости по теме общество 4',
            'Новости Общество 5'=>'Последние новости по теме общество 5'
        ];

        $this->policy = [
            'Новости Политика 1'=>'Последние новости по теме политика 1',
            'Новости Политика 2'=>'Последние новости по теме политика 2',
            'Новости Политика 3'=>'Последние новости по теме политика 3',
            'Новости Политика 4'=>'Последние новости по теме политика 4',
            'Новости Политика 5'=>'Последние новости по теме политика 5'
        ];

        $this->culture = [
            'Новости Культура 1'=>'Последние новости по теме культура 1',
            'Новости Культура 2'=>'Последние новости по теме культура 2',
            'Новости Культура 3'=>'Последние новости по теме культура 3',
            'Новости Культура 4'=>'Последние новости по теме культура 4',
            'Новости Культура 5'=>'Последние новости по теме культура 5'
        ];

        $this->economy = [
            'Новости Экономика 1'=>'Последние новости по теме экономика 1',
            'Новости Экономика 2'=>'Последние новости по теме экономика 2',
            'Новости Экономика 3'=>'Последние новости по теме экономика 3',
            'Новости Экономика 4'=>'Последние новости по теме экономика 4',
            'Новости Экономика 5'=>'Последние новости по теме экономика 5'
        ];

        $this->sport = [
            'Новости Спорта 1'=>'Последние новости по теме спорт 1',
            'Новости Спорта 2'=>'Последние новости по теме спорт 2',
            'Новости Спорта 3'=>'Последние новости по теме спорт 3',
            'Новости Спорта 4'=>'Последние новости по теме спорт 4',
            'Новости Спорта 5'=>'Последние новости по теме спорт 5'
        ];
    }

    public function categoryNews(){

        return view('News.category', ['category'=>$this->category]);
    }

    public function listNews(){
        return view('News.listNews', ['society'=>$this->society]);
    }

    public function getListNews()
    {
        return view('News.welcome', ['news'=> $this->news]);
    }

    public function getNews(int $id)
    {
        if(!isset($this->news[$id])){
            return abort(404);
        }

        return view('News.news_page', ['news'=>$this->news[$id]]);
    }

    public function getAboutPage(){
        return view('News.about');
    }

    public function getContactsPage(){
        return view('News.contacts');
    }
}

